{
  "version": "8.20.0",
  "codename": "FluxDrive Integration & Kasplex Support",
  "info": [
    "Version 8.20.0 introduces groundbreaking file management capabilities through FluxDrive integration and expands blockchain support with Kasplex Testnet, delivering enhanced functionality and user experience improvements."
  ],
  "bugs": [
    "User Interface Improvements: Various enhancements for better user experience.",
    "FluxDrive App Navigation: Direct routing to FluxDrive from Apps section instead of external links.",
    "Various Minor Bug Fixes: Multiple stability and performance improvements across the platform."
  ],
  "features": [
    "FluxDrive File Management System: Revolutionary decentralized file storage and management capabilities.",
    "File Upload/Download: Complete file upload and download functionality with drag-and-drop support.",
    "File Type Validation: Advanced file type validation and size restrictions for security.",
    "Upload Progress Tracking: Progress tracking for upload operations with parallel processing support.",
    "Secure File Encryption: Secure file encryption before upload to protect user data.",
    "Flux Ecosystem Integration: Integration with Flux ecosystem for decentralized storage solutions.",
    "File Organization: File organization with folder management and navigation capabilities.",
    "Cross-platform File Access: Cross-platform file system access.",
    "Kasplex Testnet Blockchain Support: New testnet integration expanding Kaspa ecosystem support.",
    "Native KAS Coin: Native KAS coin support for testnet transactions.",
    "WKAS Token Support: WKAS token support on the Kasplex testnet network.",
    "Kasplex WalletConnect: Full WalletConnect integration for dApp connectivity.",
    "Seed Phrase Security: Enhanced seed phrase handling with improved validation.",
    "Automatic Text Processing: Automatic trimming and lowercase conversion for consistency.",
    "Better Paste Handling: Improved paste handling with multi-word support.",
    "General Improvements: Various performance optimizations and enhancements to ensure a smooth user experience."
  ]
}
