{
  "version": "8.19.1",
  "codename": "Sui Blockchain Integration & AI Enhancement",
  "info": [
    "Version 8.19.0 introduces major new blockchain support and AI capabilities, expanding ZelCore's functionality with cutting-edge features."
  ],
  "bugs": [
    "FluxNodes Dashboard: Resolved issues with node management and status display.",
    "Transaction Processing: Improved reliability for various blockchain transactions.",
    "Out of Commission Handling: Added proper handling for temporarily unavailable coins (Fantom, EOS).",
    "Various Minor Bug Fixes: Multiple stability and performance improvements across the platform."
  ],
  "features": [
    "Etherscan Backends: Updated to use v2 endpoints for enhanced performance and reliability.",
    "Daemon Update: Updated Flux Mac daemon to latest version for improved performance and stability.",
    "Horizen Decommission: Horizen is being decommissioned and will be removed in the future version.",
    "FluxAI GPT Integration: Revolutionary AI assistant feature powered by Flux infrastructure.",
    "Interactive AI Chat: Advanced chat interface with persistent session management and conversation history.",
    "Multi-Language AI Support: AI assistant supports multiple languages for global accessibility.",
    "Secure Data Handling: AI features include robust encryption and secure data processing.",
    "Sui Blockchain Support: Complete integration of the Sui blockchain, enabling users to manage Sui assets directly within ZelCore.",
    "Native SUI Coin: Full send/receive functionality for the native SUI cryptocurrency.",
    "Sui USDC Token: Support for USDC token on the Sui network with complete transaction capabilities.",
    "Swap support for SUI blockchain: Users can swap SUI and USDC tokens seamlessly.", 
    "Sui WalletConnect Integration: Connect to Sui dApps and services through industry-standard WalletConnect protocol.",
    "Enhanced Backend Infrastructure: Improved middleware integration for better API performance and reliability.",
    "Flux Daemon Updates: Latest version integration for improved performance and stability.",
    "General Improvements: Various performance optimizations and enhancements to ensure a smooth user experience."
  ]
}
