{
  "version": "8.15.4",
  "codename": "Powered by Flux",
  "info": [
    "We are proud to release Version 8.15.4, delivering crucial updates in security, major improvements in encryption, and an entirely revamped Fluxnode Dashboard."
  ],
  "bugs": [
    "UI Fixes and Adjustments: Various Purchase and Swap UI Treatments. Other UI improvements.",
    "Monero Sending Fix: Fixed a bug related to monero cryptoasset sending.",
    "UI Fixes and Adjustments: Various Fluxnodes App UI Treatments. Other UI improvements",
    "Mobile GCM decryption incompatibility: Resolved an issue where mobile GCM decryption was incompatible with the latest version of the desktop.",
    "Various Minor Bug Fixes: A range of minor bugs have been fixed to improve the overall user experience and ensure smoother operation of the wallet."
  ],
  "features": [
    "Blockchain Support: Introduced support for the Ink Chain (powered by Kraken), including native ETH, USDC.E token, and WalletConnect capabilities.",
    "User Interface & Experience: Integrated direct links to FluxOs, FluxDrive, FluxAI, FluxEdge, and FuxionX within the APPs section.",
    "User Interface & Experience: Added new dialogs directly on the Portfolio Overview screen (Add/Hide Asset, Wallet Edit, Smartify).",
    "Flux Integration: Enhanced Flux storage validation - A Flux node alias is now required before uploading configuration data.",
    "User Interface & Experience: Improved portfolio management dialogs with an added wallet selector.",
    "User Interface & Experience: Added support link for swap, purchase and off-ramp transactions through affiliated providers.",
    "Token Support (Ethereum - ERC20): Added LDO, DEXE, MOVE, JASMY, SPX, Gala, STRK, AIOZ, MORPHO, MOG, XAUt, EIGEN, PENDLE, SUPER, PYUSD, ROSE, ZRO, BLUR, PRIME, CTC, ETHFI, ATH, CVX, XCN, ID, SFP, BIO, MEME, VANA, AUTOS.",
    "Token Support (BNB Chain - BEP20): Added LDO, DEXE, AIOZ, PENDLE, ROSE, ZRO, ID, SFP, XCN.",
    "Token Support (Solana - SPL): Added LDO, PENGU, JUP, AI16Z, SPX, JTO, GIG, aixbt, GRASS, POPCAT, ROSE, MEW, ATH, PNUT, CVX, BIO, BOME.",
    "Token Support (Base): Added SPX, ZERO, MORPHO, MOG, aixbt, PENDLE, ROSE, ZRO, PRIME, XCN.",
    "Token Support (Arbitrum): Added LDO, PENDLE, ROSE, ZRO, ETHFI, ATH.",
    "Token Support (Optimism): Added PENDLE, ROSE, ZRO.",
    "Token Support (Polygon - POLY): Added SUPER, ROSE, ZRO.",
    "Token Support (Avalanche - AVAX-C): Added ROSE, ZRO.",
    "General Improvements: Across-the-board refinements have been made to sharpen feature performance and ensure a secure, seamless wallet experience."
  ]
}
