{
  "version": "8.20.0",
  "codename": "FluxDrive Integration & Kasplex Support",
  "info": [
    "Version 8.20.0 introduces groundbreaking file management capabilities through FluxDrive integration and expands blockchain support with Kasplex Testnet, delivering enhanced functionality and user experience improvements."
  ],
  "bugs": [
    "User Interface Improvements: Various enhancements for better user experience.",
    "Various Minor Bug Fixes: Multiple stability and performance improvements across the platform."
  ],
  "features": [
    "Kasplex Mainnet (EVM): New Kasplex network available in Networks (EVM‑compatible).",
    "WKAS Support: WKAS (Wrapped Kaspa) token support on Kasplex mainnet.",
    "Kasplex Tokens: You can now import Kasplex tokens; dedicated sections added for Kasplex Testnet as well.",
    "Gas Requirements (Kasplex): KAS on Kasplex mainnet is required for gas when interacting with Kasplex contracts.",
    "IgraLabs Testnet (EVM): Token import flow and chain indicator support included.",
    "Gas Requirements (IgraLabs): KAS on IgraLabs Testnet is required for gas on IgraLabs Testnet contracts.",
    "FluxONE (inside FluxAI): AI image studio with adjustable aspect ratios, formats (JPG/PNG/WEBP), and quality controls.",
    "FluxONE Experience: Big preview, one‑click download, and mobile share support.",
    "FluxONE Sessions: Session management with interaction history and resume.",
    "Login‑less Access: FluxONE can be launched without signing in (EasyLogin screen).",
    "Model Selection: Choose models via Zelcore API provider (e.g., Llama 3.1, DeepSeek 8B/32B).",
    "FluxAI App Selector: Switch between FluxGPT (chat) and FluxONE (images).",
    "Quick‑access Widgets: New FluxAI Shortcut and FluxDrive Shortcut on Portfolio for faster access.",
    "Swap History: Each swap now shows the fiat value at the time of execution with a helpful tooltip in history and details.",
    "FluxDrive UX: Clearer max file size display (now shown in MB) and minor upload UX polish.",
    "Dependency Freeze: Reproducible builds with CI.",
    "Linux (.deb) Installer: Post‑install sets up the zelcore alternative and configures Chromium sandbox permissions for improved stability.",
    "Under the Hood: Minor hardware‑wallet library alignment and build‑script refinements."
  ]
}
