{
  "version": "8.23.0",
  "codename": "Sonic Blockchain & Enhanced Payment Features",
  "info": [
    "Version 8.23.0 introduces Sonic blockchain support, payment callback functionality for merchants, Zcash TEX address support, and important infrastructure updates."
  ],
  "bugs": [
    "Enhanced authentication flow with better error handling",
    "Various UI/UX improvements and stability fixes",
    "General Cleanups: Package and copy refinements across the app."
  ],
  "features": [
    "Sonic Blockchain Support (EVM): Complete integration of the Sonic blockchain with the following features: Native S coin support with full send/receive functionality; USDC, USDT, and wS (Wrapped Sonic) token support; WalletConnect integration for Sonic dApps and services; Etherscan-compatible API integration.",
    "Payment Callback System: New merchant-focused feature enabling real-time payment confirmations: Callback URLs can be included in payment URIs; Automatic POST notification after successful transactions with transaction details (ID, addresses, amount, coin); Supports HTTP/HTTPS protocols with 10-second timeout; Compatible with all supported blockchain types.",
    "Zcash TEX Address Support: Added support for Bech32m-encoded transparent addresses (ZIP-320 standard): Full TEX address validation and conversion; Backward compatible with legacy t-addresses; Enhanced address flexibility for Zcash transactions.",
    "Global Transaction History: New wallet-level transaction view showing recent activity: Displays 20 most recent transactions across all assets; Includes blockchain icon overlays and coin name display; Refresh button for manual updates; Wallet label display in transaction details.",
    "Login Experience Improvements: New MainLogin screen with improved user interface; Enhanced EasyLogin workflow as default entry point; Legacy login option with clear visual indicators.",
    "Kadena Explorer URLs: Updated to use community-maintained explorers: Mainnet: explorer.kda.zelcore.io; Testnet/Devnet: explorer.chainweb-community.org.",
    "Full Node Binaries: Updated daemon versions for improved stability and performance",
    "Package Dependencies: Updated multiple core dependencies for security and performance",
    "Under the Hood: Minor hardware‑wallet library alignment and build‑script refinements."
  ]
}
